[
{"ingredients": ["1 tablespoon olive oil", "1 pound skinless, boneless chicken breast meat - cut into bite-size pieces", "3 cloves crushed garlic", "3/4 cup white wine", "3/4 cup chicken stock", "3 (16 ounce) cans great Northern beans, drained", "1 (14 ounce) bag baby spinach", "1 (14 ounce) can artichoke hearts in water, drained and quartered", "1 (8 ounce) can whole black olives, drained", "1 tablespoon chopped fresh tarragon", "1 sprig fresh rosemary", "ground black pepper to taste", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Quick Chicken Cassoulet with Artichoke and Olives Recipe - Allrecipes.com"], "instructions": ["Heat the oil in a large pot over medium-high heat. Stir in the chicken breast, and cook 3 minutes, stirring occasionally. Add the garlic, and continue cooking until the chicken has turned golden brown on all sides. Pour in the white wine, and simmer for 1 minute, then stir in the chicken stock, great Northern beans, spinach, artichokes, olive, tarragon, and the whole rosemary sprig. Season with ground black pepper.", "Bring the mixture to a simmer, then reduce heat to medium-low, cover, and simmer 30 minutes, stirring occasionally. Remove the rosemary sprig before serving."]},
{"ingredients": ["1 pound dry kidney beans", "water to cover", "1/4 teaspoon ground turmeric", "salt to taste", "1 tablespoon vegetable oil", "3 tomatoes, chopped", "1 onion, minced", "1 (2 inch) piece fresh ginger, minced", "2 cloves garlic, minced", "1 teaspoon cumin seeds", "2 teaspoons garam masala", "2 teaspoons ground coriander", "1/2 teaspoon red chile powder", "1/4 teaspoon heeng (asafoetida powder)", "2 teaspoons curd (plain yogurt)", "2 sprigs fresh cilantro, leaves finely chopped", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Rajma (Kidney Beans) Recipe - Allrecipes.com"], "instructions": ["Place kidney beans into a large container and cover with several inches of cool water; let stand 8 hours to overnight. Drain and rinse kidney beans.", "Combine kidney beans, ground turmeric, and salt in a pressure cooker; add enough water to cover beans. Cover pressure cooker with lid and cook beans according to manufacturer's instructions until tender, about 20 minutes. Release pressure from pressure cooker.", "Heat oil in a skillet over medium heat; cook and stir tomatoes, onion, ginger, garlic, and cumin seeds until heated through and fragrant, 2 to 4 minutes.", "Mix garam masala, ground coriander, red chile powder, and heeng into tomato mixture; simmer for 2 minutes. Add kidney beans and curd; simmer until heated through, about 5 minutes. Top rajma with cilantro."]},
{"ingredients": ["2 Asian bitter melon (goya)", "kosher salt as needed", "2 tablespoons sesame oil", "1 (1 pound) pork loin, cut into pieces", "1 pinch garlic salt, or to taste", "1 pinch garlic pepper, or to taste", "2 eggs", "1 tablespoon soy sauce, or to taste", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Goya Champuru (Bitter Melon Stir Fry) Recipe - Allrecipes.com"], "instructions": ["Cut tips off melons with a sharp knife; cut in half lengthwise. Scoop out white interior and seeds with a spoon; rinse the melon. Cut into very small pieces. Place in a bowl and generously add kosher salt, mixing until melon is completely covered. Cover and refrigerate until flavors combine, about 5 minutes.", "Rinse melon to remove excess salt. Place into a pot filled with water; cover and bring to a boil. Cook until melon has softened slightly, about 1 minute. Remove from heat; drain the melon.", "Heat sesame oil in a skillet over medium-high heat. Add pork; season with garlic salt and garlic pepper. Cook and stir until pork is no longer pink, 7 to 10 minutes. Add melon; cook until soft, about 5 minutes.", "Reduce heat to medium. Push pork mixture to the edges of the skillet with a spatula. Crack eggs into the center of the skillet; scramble until firm, 3 to 5 minutes. Stir contents of the skillet together until combined. Season with soy sauce."]},
{"ingredients": ["3/4 pound skinless chicken thighs", "1 (15 ounce) can sliced peaches, drained, juice reserved", "1 (8.75 ounce) can apricot halves, drained, juice reserved", "1 tablespoon white vinegar, or to taste", "1/2 cup shelled pistachio nuts", "1 teaspoon curry powder (optional)", "1 teaspoon garam masala (optional)", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Tangy Chicken with Pistachios and Fruit Recipe - Allrecipes.com"], "instructions": ["Preheat the oven to 375 degrees F (190 degrees C).", "Place the chicken thighs in a shallow baking dish. Drain the peaches and apricots, reserving the juice in a small bowl. Stir the vinegar into the juice, and adjust the amount to taste if necessary. Season with curry powder and garam masala and stir to blend. Arrange the peaches and apricots around the chicken thighs, and pour the flavored syrup over all. Sprinkle the pistachios on top.", "Bake uncovered for 1 hour in the preheated oven, until sauce has thickened and chicken juices run clear."]},
{"ingredients": ["Pastry Shells:", "1 cup water", "1/2 cup unsalted butter", "2 tablespoons white sugar", "1/2 teaspoon salt", "1 cup all-purpose flour", "4 eggs", "Filling:", "10 1/2 ounces goat cheese", "1 tablespoon dried dill weed", "salt to taste", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Savory Vegetarian Cream Puffs Recipe - Allrecipes.com"], "instructions": ["Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet or baking stone with a silicone liner or parchment paper.", "Place water, butter, sugar, and salt in a saucepan over medium-high heat. Cook, stirring occasionally, until mixture is melted and dissolved, about 5 minutes. Reduce heat to medium. Add flour all at once and cook, stirring vigorously, until a ball of dough forms and pulls away from the sides of the pan, 15 to 30 seconds.", "Transfer dough to the bowl of a stand mixer fitted with a paddle attachment. Let cool, about 5 minutes. Add eggs one at a time, beating on medium-low speed after each addition, until batter is smooth and shiny, about 5 minutes.", "Transfer batter to a pastry bag fitted with a large round tip. Pipe the batter into 2-inch mounds by squeezing close to the sheet and slowly pulling up.", "Increase oven temperature to 450 degrees F (230 degrees C).", "Bake in the preheated oven until puffy, about 10 minutes. Reduce oven temperature to 350 degrees F (175 degrees C) and continue baking until shells are crispy and set, 13 to 15 minutes more.", "Place goat cheese, dill, and salt in a stand mixer fitted with a whisk attachment. Mix until filling is creamy and smooth, 2 to 3 minutes. Transfer to a pastry bag fitted with a small round tip. Pipe filling into the bottom of each shell until filled."]},
{"ingredients": ["1 clove garlic, halved, divided", "1 pound cherry tomatoes, halved", "1 bunch fresh rosemary, minced", "1 teaspoon extra-virgin olive oil", "1 teaspoon red pepper flakes", "1 pinch salt", "1 loaf crusty Italian bread, sliced and toasted", "7 ounces lardo (such as Lardo di Colonnata)", "freshly ground pink peppercorns to taste", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Bruschette al Lardo di Colonnata Recipe - Allrecipes.com"], "instructions": ["Mince 1 of the garlic halves and transfer to a bowl. Add tomatoes, rosemary, olive oil, red pepper flakes, and salt; mix well. Refrigerate tomato mixture for 1 hour.", "Rub the remaining garlic half over each slice of bread. Spread lardo onto each slice and top with tomato mixture. Sprinkle ground pink peppercorns over tomato mixture."]},
{"ingredients": ["1 (20 ounce) can white hominy", "1 clove garlic, minced", "1 tablespoon chopped jalapeno pepper, or to taste", "1/2 cup sour cream", "1 tablespoon butter, or to taste", "1 cup shredded Cheddar cheese", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Grandma's Hot Hominy Recipe - Allrecipes.com"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C).", "Combine hominy, garlic, and jalapeno in a saucepan. Bring to a boil, reduce heat, and simmer until hominy is tender, 15 to 20 minutes. Strain out liquid and pour hominy mixture into baking dish. Stir sour cream and butter into hominy mixture; top with Cheddar cheese.", "Bake in preheated oven until cheese melts, about 25 minutes."]},
{"ingredients": ["1 (16 ounce) package linguine pasta, cooked and kept warm", "2 (5 ounce) cans Bumble Bee® Solid White Albacore Tuna in Water, undrained", "1 (6 ounce) package frozen peas", "8 ounces fresh peas, rinsed", "1 medium onion, diced", "1 tablespoon minced garlic", "1/2 cup julienne cut sun-dried tomatoes with herbs, drained, oil reserved", "2 cups vegetable broth", "Salt and black pepper to taste", "Crushed red pepper flakes to taste (optional)", "1 tablespoon chopped fresh parsley", "1/4 cup grated Parmesan cheese for topping (optional)", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Jan's Pasta-N-Peas with Tuna and Sun-Dried Tomatoes Recipe - Allrecipes.com"], "instructions": ["Place the oil from the sun dried tomatoes in a large saute pan over medium heat. Add in onions and garlic. Cook over medium heat until onions begin to turn translucent, about 4 minutes. Add the broth to the onions and bring to a simmer.", "Stir in the peas and the sun dried tomatoes. Cook for another 3 minutes.  Peas should remain crisp so be careful not to over cook.", "Stir in undrained tuna and heat through. Be careful not to break up too many large pieces of the tuna while stirring. Cook about 2-3 minutes. Add salt and pepper to taste and crushed red pepper if desired.", "Serve immediately over hot pasta. Garnish with parsley and top with grated Parmesan cheese."]},
{"ingredients": ["Brine:", "3 quarts cold water", "3 (12 fluid ounce) bottles lager beer", "2 onions, cut into wide slices", "1 1/2 cups kosher salt", "1/2 cup dark brown sugar", "5 tablespoons curing salt", "1/4 cup pickling spice", "2 tablespoons chopped garlic", "1 (5 pound) beef brisket, fat trimmed to a thin layer", "wood chips", "2 cups apple juice, or as needed", "Braising Liquid:", "1 (12 fluid ounce) bottle lager beer", "1 onion, cut into large slices", "2 tablespoons dark brown sugar", "2 tablespoons pickling spice", "2 tablespoons chopped garlic", "1 teaspoon ground black pepper (optional)", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Jan's Beer-Brined Corned Beef Recipe - Allrecipes.com"], "instructions": ["Place water, 3 bottles beer, 2 onions, kosher salt, 1/2 cup brown sugar, curing salt, 1/4 cup pickling spice, and 2 tablespoons garlic in a very large pot. Stir well until salts are dissolved. Add beef; stir gently. Use a large bowl or heavy plate to keep the beef submerged. Cover with plastic wrap and refrigerate, stirring once a day, for 4 days.", "Soak wood chips in apple juice for 2 hours.", "Remove beef from pot, discarding brine, and rinse well until cold water. Let beef come to room temperature.", "Preheat an outdoor grill to 150 to 175 degrees F (65 to 80 degrees C). Place soaked wood chips in a shallow aluminum pan on the heat source.", "Place meat directly on the grate and allow to smoke for 2 hours.", "Combine 1 beer, 1 onion, 2 tablespoons brown sugar, 2 tablespoons pickling spice, 2 tablespoons chopped garlic, and black pepper in a large saucepan; bring to a boil. Remove from heat and pour into a large roasting pan. Place beef in braising liquid in the roasting pan and cover tightly with aluminum foil.", "Increase grill temperature to 250 degrees F (120 degrees C). Place the roasting pan on the grill and close the lid.", "Roast the beef until tender, 3 to 4 hours. An instant-read thermometer inserted into the center should read at least 145 degrees F (60 degrees C).", "Remove beef from the roasting pan, discarding braising liquid. Let beef cool until easily handled.", "Slice beef into very thin slices across the grain."]},
{"ingredients": ["2 large baking potatoes", "1 1/2 cups finely chopped cabbage", "1/2 cup finely chopped onion", "4 slices bacon, chopped", "1/2 cup milk", "1/4 cup butter", "1/4 teaspoon ground black pepper", "salt to taste", "3/4 cup shredded Cheddar cheese, divided", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Irish Stuffed Baked Potato Recipe - Allrecipes.com"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C).", "Scrub potatoes, pierce several times with a fork, and place on microwave-safe plate. Cook potatoes on High in microwave 5 minutes; turn over and cook until soft, about 5 minutes more. Scoop potato flesh into a bowl; reserve potato skins.", "Cook and stir cabbage, onion, and bacon in a skillet over medium heat until vegetables are soft, about 10 minutes. Stir milk, butter, pepper, and salt into cabbage mixture; stir in potato flesh and 1/2 cup of Cheddar cheese. Cook and stir cabbage mixture, breaking up potato and mashing lightly, until milk is absorbed, about 5 minutes.", "Remove pan from heat; pile potato mixture into potato skins and place stuffed potatoes in a baking dish. Sprinkle potatoes with remaining Cheddar cheese.", "Bake in the preheated oven until cheese is bubbly and potatoes are heated through, about 25 minutes."]},
{"ingredients": ["3 tablespoons water", "6 cloves garlic", "2 serrano chile peppers, stemmed", "1 (2 inch) piece fresh ginger, peeled and thinly sliced", "1/4 cup ghee (clarified butter)", "2 pounds chicken drumsticks", "salt and ground black pepper to taste", "1 large white onion, sliced", "1 tablespoon dried fenugreek leaves", "2 teaspoons ground coriander", "1 teaspoon garam masala", "1/2 teaspoon ground turmeric", "3 plum tomatoes, grated", "3/4 cup milk", "1/2 cup heavy whipping cream", "1/3 cup finely chopped fresh cilantro", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Indian-Style Chicken and Onions Recipe - Allrecipes.com"], "instructions": ["Puree water, garlic, serrano chile peppers, and ginger together in a blender or food processor until smooth.", "Heat ghee in a 6-quart saucepan over medium heat. Season chicken with salt and pepper. Cook chicken in hot ghee until browned, 3 to 4 minutes per side. Transfer chicken to a plate.", "Cook and stir garlic puree in the 6-quart saucepan until golden, 2 to 3 minutes. Add onion; cook and stir until golden, 5 to 7 minutes. Add fenugreek, coriander, garam masala, and turmeric to onion mixture; cook and stir until fragrant, about 1 minute.", "Stir tomatoes into onion mixture; cook and stir until tomatoes are lightly browned, 4 to 6 minutes. Add chicken, milk, and cream; bring to a boil. Reduce heat to medium, cover saucepan, and cook until chicken is no longer pink in the center and tender, 15 to 20 minutes. Transfer chicken to a serving platter using a slotted spoon. Continue cooking sauce until slightly reduced, 5 to 7 more minutes. Stir cilantro into sauce and pour over chicken."]},
{"ingredients": ["2 (15 ounce) cans asparagus", "1 (2.25 ounce) can sliced black olives", "1/2 pound fettuccini pasta", "1 tablespoon olive oil", "3 large portobello mushrooms, sliced", "1 (8 ounce) can peas, drained", "2 teaspoons Italian seasoning", "1 (6 ounce) can tomato paste", "1/2 cup grated Parmesan cheese", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Asparagus Portobello Pasta Recipe - Allrecipes.com"], "instructions": ["Fill a large pot with water and the drained liquids of the asparagus and the olives; bring to a boil.  Cook pasta for 8 to 10 minutes, or until al dente. Drain.", "Meanwhile, heat oil in a large skillet over medium heat.  Saute mushrooms, peas, and Italian seasoning until mushrooms are tender.", "In a blender or food processor, puree asparagus, black olives, tomato paste and Parmesan.  Transfer to a small saucepan, and heat through over medium-low heat.  Spoon asparagus sauce over fettuccini, and top with mushrooms and peas."]},
{"ingredients": ["2 tablespoons chopped fresh cilantro", "4 cloves garlic", "1 teaspoon cumin seeds", "1 teaspoon Himalayan pink salt", "1 teaspoon ground turmeric", "1 teaspoon paprika", "1 teaspoon Italian seasoning", "1 teaspoon salt-free seasoning blend (such as Mrs. Dash®)", "1/2 teaspoon ground black pepper", "1/4 cup olive oil", "1 pound lean ground beef", "1 onion, diced", "1 large potato, peeled and cubed", "2 carrots, diced", "2 (14 ounce) cans diced tomatoes", "2 tablespoons water, or to taste (optional)", "1 (16 ounce) package angel hair pasta", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Somali Spaghetti Sauce Recipe - Allrecipes.com"], "instructions": ["Place cilantro and garlic in a food processor; pulse until finely chopped.", "Toast cumin seeds in a small pot over low heat until fragrant, 2 to 3 minutes. Allow to cool, 5 minutes. Grind into a powder.", "Transfer ground cumin to a small bowl. Add Himalayan pink salt, turmeric, paprika, Italian seasoning, seasoning blend, and black pepper to make seasoning mix.", "Heat oil in a large pot over medium heat. Add ground beef; cook and stir until browned, about 5 minutes. Stir in 1/2 of the seasoning mix. Add onion; cook and stir until softened, about 5 minutes. Add potato and carrots. Cook, covered, stirring occasionally, until slightly softened, about 5 minutes.", "Stir tomatoes into the pot and bring sauce to a boil. Reduce heat to medium-low; stir in cilantro-garlic mixture and remaining 1/2 of the seasoning mix. Simmer, stirring occasionally, until flavors combine, 30 to 40 minutes. Thin sauce with water if it seems too thick.", "Bring a large pot of lightly salted water to a boil. Cook angel hair in the boiling water, stirring occasionally until tender yet firm to the bite, 4 to 5 minutes. Drain. Serve sauce over pasta."]},
{"ingredients": ["1 (3 ounce) package cream cheese, softened", "3 ounces crumbled Gorgonzola cheese", "36 pitted dates", "36 walnut pieces", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Stuffed Dates Recipe - Allrecipes.com"], "instructions": ["Mix cream cheese and Gorgonzola cheese together in a bowl.", "Cut a slit into each date so they can be spread flat. Spread cheese mixture into each date; top with a walnut piece."]},
{"ingredients": ["4 cups milk", "2 cups white sugar", "3 eggs", "3/4 cup grated Parmesan cheese", "2 1/2 tablespoons softened butter", "1 1/2 cups grated coconut", "1 cup cornmeal", "2 tablespoons all-purpose flour", "1 tablespoon baking powder", "1 pinch salt", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Bolo de Fuba Cremoso (Creamy Cornmeal Cake) Recipe - Allrecipes.com"], "instructions": ["Preheat oven to 300 degrees F (150 degrees C). Grease a 9-inch cake pan.", "Combine milk, sugar, eggs, Parmesan cheese, and butter in a blender; blend until smooth, about 5 minutes. Add coconut, cornmeal, and flour; blend until creamy. Add baking powder and salt and blend until smooth. Pour into the prepared cake pan.", "Bake in the preheated oven until top is golden brown and edges pull away from the sides of the pan, about 30 minutes."]},
{"ingredients": ["2 cups cashews", "1 1/2 cups water", "1/2 cup pine nuts", "1/4 cup nutritional yeast", "3 cloves garlic", "1 tablespoon lemon juice", "1 teaspoon sea salt", "1 teaspoon dried thyme", "ground black pepper to taste", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["No-Cook Cashew Alfredo Recipe - Allrecipes.com"], "instructions": ["Blend cashews, water, pine nuts, nutritional yeast, garlic, lemon juice, sea salt, thyme, and pepper together in a blender or food processor until smooth."]},
{"ingredients": ["1 mango - peeled, seeded, and chopped", "2 carrots, cut into chunks", "1 banana, chopped", "1 yellow bell pepper, chopped, or to taste", "1/2 red bell pepper, chopped, or more to taste", "1 ounce chilled mineral water, or as needed", "1 teaspoon lemon juice, or to taste", "1 teaspoon honey, or to taste (optional)", "1 teaspoon chia seeds, or to taste (optional)", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Very Orange Smoothie without Oranges Recipe - Allrecipes.com"], "instructions": ["Blend mango, carrots, banana, yellow bell pepper, red bell pepper, mineral water, lemon juice, honey, or chia seeds in a blender until smooth. Add more water for a thinner consistency."]},
{"ingredients": ["Dry Rub:", "1 tablespoon kosher salt", "1 1/2 teaspoons ground black pepper", "1 1/2 teaspoons Cajun seasoning", "2 1/2 pounds chicken wings", "Sauce:", "2/3 cup hot pepper sauce (such as Frank's RedHot®)", "1/2 cup butter", "1 1/2 tablespoons white vinegar", "1/2 teaspoon Worcestershire sauce", "1/8 teaspoon garlic powder", "1 pinch salt to taste", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Smoked Chicken Hot Wings Recipe - Allrecipes.com"], "instructions": ["Heat a smoker to 225 degrees F (110 degrees C) according to manufacturer's directions.", "Mix 1 tablespoon salt, pepper, and Cajun seasoning in a small bowl to make dry rub. Sprinkle over chicken wings.", "Cook chicken wings in the preheated smoker until tender, 1 to 1 1/4 hour.", "Combine hot pepper sauce, butter, vinegar, Worcestershire sauce, garlic powder, and salt in a small saucepan over low heat. Cook, stirring often, until butter is melted and sauce is smooth. Remove from heat.", "Preheat an outdoor grill for medium-high heat and lightly oil the grate.", "Transfer smoked wings to a large bowl; stir in 1/2 of the sauce until wings are evenly coated.", "Grill coated wings until skin is browned and starting to get crispy, 4 to 5 minutes per side. Transfer to a large bowl and stir in remaining sauce until wings are well-coated."]},
{"ingredients": ["2 cups diced fresh mango", "2 cups fresh peaches, pitted and chopped", "2 cloves garlic, minced", "2 tablespoons chopped fresh ginger root", "1/4 cup chopped fresh basil", "2 serrano chile peppers, diced", "1/4 cup fresh lime juice", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Spicy Mango Salsa Recipe - Allrecipes.com"], "instructions": ["In a large bowl, mix together the mangoes, peaches or nectarines, garlic, ginger and basil or cilantro.", "Add the chilies and lime juice to taste; mix well. Allow to chill 2 hours before serving."]},
{"ingredients": ["1/2 pound sage pork sausage (such as Jimmy Dean®)", "1 1/2 cups cubed red potatoes", "1/2 onion, diced", "1 tablespoon chopped garlic", "1 cup sliced baby bella mushrooms", "3 eggs", "1 teaspoon parsley", "1/2 cup shredded Mexican cheese blend", "sea salt to taste", "fresh cracked black pepper to taste", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Single Skillet Hearty Breakfast Recipe - Allrecipes.com"], "instructions": ["Place sausage in a large cast iron skillet over medium heat; cook and stir until crumbly and starting to brown, about 5 minutes. Stir in potatoes; cook until starting to brown, about 5 minutes. Add onion and garlic; cook and stir until fragrant, about 3 minutes. Stir in mushrooms; cook until tender, about 5 minutes.", "Push mixture to the sides of the skillet with a spatula to make space in the center. Crack eggs into the center and sprinkle with parsley. Sprinkle Mexican cheese blend around mixture on the edges. Cover skillet and cook until egg whites are set but yolk is still runny, 2 to 3 minutes. Remove from heat, pierce yolks and mix to combine. Season with salt and black pepper."]},
{"ingredients": ["2 large potatoes, peeled and coarsely shredded", "1/4 cup all-purpose flour", "1 egg", "2 slices prosciutto, chopped", "salt and ground black pepper to taste", "1/4 cup extra-virgin olive oil, or as needed", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Polpette di Patate Fritte (Potato and Prosciutto Fritters) Recipe - Allrecipes.com"], "instructions": ["Place shredded potatoes in a bowl; add flour, egg, and ham and mix well. Season mixture with salt and pepper. Form mixture into fritters.", "Heat oil in a skillet over medium heat; fry fritters until golden, about 5 minutes per side."]},
{"ingredients": ["2 cups vegetable oil", "4 large flour tortillas", "1 cup salsa", "1 cup shredded Cheddar cheese", "1/4 cup freshly grated Parmesan cheese", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Quick and Easy Mexican Pizza Recipe - Allrecipes.com"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C).", "Heat vegetable oil in a large skillet over medium-high heat until hot; fry tortillas, one at a time, until golden brown, 2 to 3 minutes per side. Transfer fried tortillas using tongs to a baking sheet.", "Spread salsa onto each fried tortilla; top with Cheddar cheese and Parmesan cheese.", "Bake in the preheated oven until cheese is melted, about 8 minutes."]},
{"ingredients": ["4 ears fresh corn kernels", "2 seeded and finely chopped jalapeno peppers", "1/2 pound husked, cored and chopped tomatillos", "1/2 chopped green bell pepper", "2 thinly sliced green onions", "2 tablespoons fresh lime juice", "2 tablespoons water", "1/2 teaspoon ground coriander", "2 tablespoons chopped fresh cilantro", "1 (14.5 ounce) package tortilla chips", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Corn and Tomatillo Salsa Recipe - Allrecipes.com"], "instructions": ["In a large skillet, combine the corn kernels and jalapeno peppers. Cook and stir for 10 minutes, until the jalapenos are soft.", "In a saucepan over high heat, combine the corn and jalapeno mixture with the tomatillos, green bell peppers, green onions, lime juice, water and coriander. Cover and bring to a boil. Reduce heat to low and simmer 5 minutes, stirring once. Remove from heat. Cool for 10 minutes. Stir in the cilantro. Allow the mixture to cool in the refrigerator. Serve with tortilla chips."]},
{"ingredients": ["2 cups water", "1/2 jalapeno pepper, very thinly sliced", "1 (3 ounce) package chicken-flavored ramen noodles", "2 mushrooms, thinly sliced", "3 wedges lime, juiced", "1 green onion, sliced", "1 tablespoon cilantro leaves", "1/4 teaspoon garlic chile paste", "1/8 teaspoon sesame oil", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Superfast Asian Noodle Bowl for 1 Recipe - Allrecipes.com"], "instructions": ["Bring water to a boil in a saucepan. Stir in jalapeno; cook for 2 minutes. Add ramen noodles with seasoning packet and mushrooms. Cook until noodles are tender, about 5 minutes.", "Ladle noodle mixture into a bowl; garnish with lime juice, green onion, cilantro, garlic chile paste, and sesame oil."]},
{"ingredients": ["butter for greasing", "1/2 cup honey", "2 tablespoons milk", "9 sweet potatoes, peeled and cut into 1/4-inch slices", "1/4 cup grated fresh ginger", "3 tablespoons grapeseed oil", "1 tablespoon chopped fresh rosemary, or more to taste", "1 1/2 teaspoons ground cardamom", "1 teaspoon ground black pepper", "1 teaspoon ground cloves", "1/2 teaspoon salt", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Rosemary Sweet Sweet Potatoes with Ginger Recipe - Allrecipes.com"], "instructions": ["Preheat oven to 400 degrees F (200 degrees C). Lightly butter a large baking dish.", "Whisk honey and milk together in a bowl until smooth.", "Place sweet potatoes in a large bowl. Add honey-milk mixture to sweet potatoes and toss to coat; soak for 10 minutes. Drain 1/2 of the liquid from the bowl.", "Mix ginger, rosemary, grapeseed oil, cardamom, black pepper, cloves, and salt with the sweet potatoes until coated. Spread potatoes in a single layer in the prepared baking dish.", "Bake in the preheated oven for 20 minutes. Flip potatoes and continue cooking until tender and browned, about 20 minutes more."]},
{"ingredients": ["cooking spray", "4 (6 ounce) salmon fillets", "1/4 lemon, juiced, or more to taste", "2 teaspoons dried dill weed", "1/4 cup Dijon mustard", "2 large dill pickles, diced", "1/2 white onion, diced", "1 tomato, seeded and diced", "4 sport peppers, chopped, or to taste (optional)", "1 dash celery seed, or to taste", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Chicago Hot Dog-Style Salmon Recipe - Allrecipes.com"], "instructions": ["Preheat oven to 400 degrees F (200 degrees C).", "Spray four 6x6-inch pieces of aluminum foil with cooking spray. Place salmon fillets on top.", "Drizzle lemon juice over salmon fillets; sprinkle 1/2 teaspoon of dill weed over each one. Spread 1 tablespoon mustard onto each salmon fillet; top with dill pickle and onion. Wrap aluminum foil around salmon, sealing the edges. Place packets onto a baking sheet.", "Bake in preheated oven until fish flakes easily with a fork, about 15 minutes.", "Place packets in shallow bowls; open with heatproof gloves. Top with diced tomatoes and sport peppers; season with celery seed."]},
{"ingredients": ["1 pound dried rice noodles", "1 1/2 cups chopped fresh cilantro", "1/2 cup sweet Thai basil", "2 cloves garlic, halved", "1/2 teaspoon minced lemon grass bulb", "1 jalapeno pepper, seeded and minced", "1 tablespoon vegetarian fish sauce", "4 tablespoons chopped, unsalted dry-roasted peanuts", "7 tablespoons canola oil", "1/2 lime, cut into wedges", "salt and pepper to taste", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Pasta with Vietnamese Pesto Recipe - Allrecipes.com"], "instructions": ["Soak rice noodles in a large bowl of cold water for 30 minutes. Drain the noodles, and set them aside.", "Make the pesto: In a blender or food processor combine the chopped cilantro, basil, garlic cloves, lemongrass, jalapeno peppers, imitation fish sauce or salt, and 2 tablespoons of the peanuts. Whirl just until the herbs and peanuts are coarsely chopped. While the machine is running add the oil in a thin stream. Then add the remaining peanuts and run the machine in short spurts until the peanuts are coarsely chopped.", "Place soaked rice noodles into a large skillet with 1/2 cup water over medium-high heat. Stir until most of the water has been absorbed and the noodles are tender.", "Add almost all of the pesto, and stir well, adding a few tablespoons of water if the pesto is clumping.", "Taste the pasta and add more pesto, lime juice, imitation fish sauce, salt, or pepper if you like. Garnish the pasta with the remaining 2 tablespoons of peanuts, and serve right away."]},
{"ingredients": ["6 cups cubed, seeded watermelon", "1/4 cup grapeseed oil", "1 cup chopped scallions", "2 tablespoons sliced jalapeno peppers", "salt and ground black pepper to taste", "1 tablespoon chopped fresh parsley", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Warm Watermelon Salad Recipe - Allrecipes.com"], "instructions": ["Place watermelon in a large bowl.", "Heat grapeseed oil in a skillet over low heat; cook and stir scallions and jalapeno peppers until fragrant and warmed, 1 to 2 minutes. Spoon scallion mixture over watermelon; season with salt and pepper and toss to coat. Sprinkle parsley over salad."]},
{"ingredients": ["3 plums, pitted and roughly chopped", "1 peach, pitted and roughly chopped", "1/4 cup mixed fruit and vegetable juice drink (such as Juicy Juice Harvest Surprise®)", "1 pinch crushed red pepper flakes, or to taste", "1 pinch ground paprika, or to taste", "1 pinch ground cinnamon, or to taste", "3 skinless, boneless chicken breast halves", "salt and ground black pepper to taste", "1 plum, pitted and chopped", "1 peach, pitted and chopped", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Plum Peach Chicken Recipe - Allrecipes.com"], "instructions": ["Preheat oven to 375 degrees F (190 degrees C). Spray a 9x9-inch baking dish with cooking spray.", "Place 3 plums and 1 peach into the work bowl of a food processor with the juice drink, red pepper flakes, paprika, and cinnamon; process until smooth. Sprinkle the chicken on both sides with salt and pepper; place into the prepared baking dish. Pour about 3/4 of the fruit sauce over the chicken. Set the remaining sauce aside.", "Bake the chicken in the preheated oven until the sauce has thickened and baked onto the meat, the chicken is no longer pink inside, and the juices run clear, about 50 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).", "Place each chicken breast on a plate and spoon the reserved fruit sauce over the chicken. Place 1 chopped plum and 1 chopped peach into a bowl, and mix the fruit together; garnish each chicken breast with 1/3 of the chopped fruit."]},
{"ingredients": ["1/2 cup honey", "3 tablespoons unsweetened coconut cream", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Paleo Caramel Sauce Recipe - Allrecipes.com"], "instructions": ["Whisk honey and coconut cream together in a saucepan over medium-high heat; cook, stirring constantly, until mixture comes to a rolling boil. Set timer for 4 minutes and stir caramel, constantly scraping down the sides. The bubbles with be airy yet high.", "Remove saucepan from heat precisely after 4 minutes. Cool caramel for about 3 minutes. The caramel will thicken as it cools."]},
{"ingredients": ["2 large marshmallows", "2 graham cracker squares", "1 peanut butter cup", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["A Peanutty S'more Recipe - Allrecipes.com"], "instructions": ["Cook the marshmallows over an open flame or hot coals until they are browned outside, and soft all the way through, 2 to 4 minutes.", "Place the marshmallows on top of one of the graham cracker squares. Place the peanut butter cup on top of the marshmallows. Top with the last graham cracker square."]},
{"ingredients": ["1 cup all-purpose flour", "2 teaspoons baking powder", "1/4 teaspoon salt", "1/2 cup white sugar", "1/4 cup butter", "1/2 cup milk", "2 cups fresh blackberries", "1/2 cup blackberry juice", "1/2 cup white sugar", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Gerry's Cobbler Recipe - Allrecipes.com"], "instructions": ["Preheat the oven to 375 degrees F (190 degrees C). Grease a 9-inch square baking dish.", "Mix flour, baking powder, and salt in a bowl; set aside. Beat 1/2 cup white sugar and butter in another bowl until smooth. Stir flour mixture alternately with milk, into butter mixture until well mixed. Pour batter into prepared baking dish. Spoon blackberries and blackberry juice on top and sprinkle with remaining 1/2 cup sugar.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 45 minutes."]},
{"ingredients": ["1 cup all-purpose baking mix", "2 teaspoons vanilla extract", "1 teaspoon cinnamon sugar", "1/2 cup water", "3 tablespoons granulated sugar", "2 teaspoons vanilla extract", "3 cups cut-up mixed fresh fruit (sliced strawberries, bananas, peaches and/or blueberries)", "Reddi-wip Original Whipped Light Cream", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Biscuit Wedges with Fruit in Vanilla Syrup Recipe - Allrecipes.com"], "instructions": ["Preheat oven and prepare the baking mix according to package directions for rolled biscuits, adding 2 teaspoons vanilla with the measure of water listed in the package directions. Roll out or pat dough into 6-inch circle on lightly floured surface; cut into 6 wedges. Place, 2 inches apart, on ungreased baking sheet. Brush tops lightly with additional water; sprinkle with cinnamon sugar.", "Bake according to package directions.", "Mix 1/2 cup water and granulated sugar in small saucepan. Bring to a boil over medium-high heat. Reduce heat to low; simmer 5 minutes, or until slightly thickened, to a syrup-like consistency. Remove from heat; cool slightly. Stir in remaining 2 teaspoons vanilla. Pour over the fruit in large bowl; toss gently to coat.", "Split biscuits horizontally in half. Place bottom halves of biscuits on 6 dessert plates; cover evenly with half of the fruit mixture. Top each with a serving of Reddi-wip and top half of biscuit. Spoon remaining fruit mixture evenly over biscuits; top with additional serving of Reddi-wip."]},
{"ingredients": ["1 cup walnuts, chopped", "2 cups all-purpose flour", "2 teaspoons baking powder", "1/2 teaspoon baking soda", "1/4 teaspoon salt", "1 cup granulated sugar", "2 tablespoons lemon zest", "3/4 cup buttermilk", "2 eggs", "1 teaspoon pure vanilla extract", "2 tablespoons unsalted butter, melted", "2 tablespoons canola oil", "1 cup fresh or frozen blueberries", "Glaze:", "3 tablespoons granulated sugar", "2 tablespoons fresh lemon juice", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Blueberry Lemon Walnut Bread Recipe - Allrecipes.com"], "instructions": ["Preheat oven to 350 degrees F.", "In a dry skillet, toast walnuts over medium-high heat for 1 to 2 minutes.", "In a large bowl, combine all-purpose flour, baking powder, baking soda and salt. Whisk to combine.", "In a medium bowl, combine sugar, lemon zest, buttermilk, eggs, vanilla, melted butter and oil. Whisk just to combine.", "Make a well in center of dry ingredients. Add liquid ingredients and mix gently just to combine; do not over-mix. Gently fold in walnuts and blueberries.", "Pour batter into a greased and floured 8 x 4-inch loaf pan. Bake in preheated oven for 55 to 60 minutes or until tester inserted in center comes out clean. Cool on rack for 20 minutes; remove from pan, cool to room temperature.", "To make the glaze, combine sugar and lemon juice in a small saucepan. Bring to boil over high heat, then reduce heat and continue stirring until sugar dissolves.", "Brush glaze over bread while still warm."]},
{"ingredients": ["1 frozen banana, peeled and chopped", "1 (12 ounce) package soft silken tofu", "2 cups orange juice", "1 tablespoon honey", "1/2 teaspoon vanilla extract", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Orange Vanilla Blend Recipe - Allrecipes.com"], "instructions": ["In a blender combine frozen banana, tofu, orange juice, honey and vanilla. Blend until smooth."]},
{"ingredients": ["1 tablespoon coconut oil, or more as needed", "3 sweet potatoes, cubed", "1 sweet onion, chopped", "1 sweet apple, chopped", "1 clove garlic, minced", "1 tablespoon ground cinnamon", "1/4 teaspoon ground chipotle pepper", "salt to taste", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Roasted Sweets Recipe - Allrecipes.com"], "instructions": ["Preheat oven to 400 degrees F (200 degrees C).", "Spoon coconut oil onto a baking sheet; add sweet potatoes, onion, apple, and garlic. Sprinkle cinnamon, chipotle pepper, and salt over sweet potato mixture.", "Roast in the preheated oven, stirring occasionally, until sweet potatoes are tender, 20 to 30 minutes."]},
{"ingredients": ["Dough:", "1 1/4 cups warm water", "1 teaspoon active dry yeast", "3 cups bread flour", "1 1/2 teaspoons fine salt", "1/4 cup olive oil, divided", "Sauce:", "1 (28 ounce) can plain crushed tomatoes", "1 (14 ounce) can pizza sauce (such as Don Peppino®)", "Cheese:", "8 ounces low-moisture whole-milk mozzarella, very thinly sliced", "1/4 cup grated Pecorino Romano cheese", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Bakery-Style Pizza Recipe - Allrecipes.com"], "instructions": ["Combine water and yeast in a small bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes.", "Combine flour and salt together in the bowl of a stand mixer fitted with a dough hook attachment. Pour in yeast mixture. Knead dough until smooth, about 7 minutes.", "Grease a large bowl lightly with olive oil. Form dough into a tight ball and lightly grease the top. Place in the bowl; cover loosely with plastic wrap. Let rise until doubled in volume, about 30 minutes.", "Mix crushed tomatoes and pizza sauce together in a bowl to make sauce.", "Grease a heavy-gauge rimmed 12x17-inch baking sheet generously with olive oil. Press dough into the bottom. Prick dough all over with a fork. Arrange mozzarella cheese slices over dough; cover with 1 cup sauce. Sprinkle Pecorino Romano cheese on top. Drizzle remaining olive oil over pizza.", "Let pizza rise in a warm area until puffy, about 1 hour.", "Preheat oven to 450 degrees F (230 degrees C).", "Bake pizza on the center rack of the preheated oven until edges are very dark brown but top is not burnt, 15 to 20 minutes. Cool in the pan for 5 minutes before slicing into squares."]},
{"ingredients": ["4 ears fresh corn, shucked", "1 Hatch chile pepper", "1/3 cup crumbled goat cheese", "1 tablespoon lime juice", "salt and ground black pepper to taste", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Hatch Chile Corn Recipe - Allrecipes.com"], "instructions": ["Preheat an outdoor grill for medium heat, and lightly oil the grate.", "Cook corn and chile pepper on the preheated grill until corn is slightly charred and chile pepper is blistered, about 20 minutes.", "Place chile pepper in a resealable plastic bag. Let steam until softened, about 5 minutes. Peel skin off chile pepper and chop.", "Cut corn kernels off the cob into a large bowl. Stir in chopped chile pepper, goat cheese, lime juice, salt, and black pepper."]},
{"ingredients": ["3/4 cup whole wheat flour", "3/4 cup cake flour", "1/2 cup packed brown sugar", "1 tablespoon ground cinnamon", "1 tablespoon carob powder (optional)", "1 teaspoon baking powder", "1 teaspoon baking soda", "1/2 teaspoon salt", "1 1/2 tablespoons molasses", "1/4 cup vegetable oil", "2 eggs", "1 orange, juiced and zested", "1 1/2 teaspoons grated lemon zest", "1/2 cup raisins", "5 dried figs, chopped", "2 tablespoons poppy seeds", "2 cups grated carrots", "1/4 cup chopped pecans", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Fragrant and Healthy Carrot Cake Recipe - Allrecipes.com"], "instructions": ["Preheat the oven to 350 degrees F (175 degrees C). Grease a 9 inch Bundt pan.", "In a large bowl, stir together the whole wheat flour, cake flour, brown sugar, cinnamon, carob, baking powder, baking soda and salt. Make a well in the center and pour in the molasses, oil, eggs and orange juice. Mix until the dry ingredients are moistened, then stir in the orange zest, lemon zest, raisins, figs, poppy seeds, carrots and pecans until evenly distributed. Pour into the prepared pan.", "Bake for 1 hour and 10 minutes in the preheated oven, or until a knife inserted into the center of the cake comes out clean. Cool for 30 minutes before removing from the pan."]},
{"ingredients": ["6 cups thinly sliced apples", "1 cup white sugar", "1/2 cup water", "1 teaspoon ground cinnamon", "1 1/2 cups all-purpose flour", "1 1/2 teaspoons baking powder", "1/4 teaspoon salt", "1/2 cup milk", "1 cup white sugar", "1 cup boiling water", "1/2 teaspoon ground nutmeg", "1 tablespoon all-purpose flour", "1 tablespoon butter", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Apple Slump Recipe - Allrecipes.com"], "instructions": ["Combine the apples, 1 cup sugar, cinnamon, and 1/2 cup water in a saucepan. Cover with a tight fitting lid and heat to boiling.", "In a medium bowl, sift together 1 1/2 cup flour, baking powder and salt. Stir in enough milk to make a soft dough.", "Drop dough by spoonfuls onto apples. Cover pan with lid and simmer over low heat for 30 minutes. DO NOT LIFT COVER UNTIL DONE! Serve with nutmeg sauce.", "To make the nutmeg sauce: In a saucepan, mix 1 cup sugar and 1 tablespoon flour. Stir in 1 cup boiling water and cook, stirring constantly until sauce bubbles. Add butter and simmer gently 5 minutes. Remove from heat and stir in nutmeg. Serve over each serving of apple slump."]},
{"ingredients": ["1/2 cup water", "1/2 cup reduced-fat coconut milk", "1/2 cup pineapple chunks", "1/2 cup ice cubes", "1 tablespoon honey, or more to taste", "1 scoop vanilla whey protein powder", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Pina Colada Power Honey Smoothie Recipe - Allrecipes.com"], "instructions": ["Combine water, coconut milk, pineapple chunks, ice, honey, and vanilla protein powder in a blender. Blend until smooth, 1 to 2 minutes."]},
{"ingredients": ["PAM® Baking Spray", "1/2 cup confectioners' sugar, sifted", "1 (15.25 ounce) package yellow cake mix", "4 eggs", "1/2 cup water", "4 cups fresh or thawed frozen cranberries", "1 1/3 cups granulated sugar", "1 1/2 cups chopped pecans", "1/2 cup orange marmalade, melted", "Reddi-wip® Extra Creamy Whipped Cream", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Cranberry Cake Rolls Recipe - Allrecipes.com"], "instructions": ["Preheat oven to 350 degrees F. Spray 2 (15x10x1-inch) baking pans with baking spray. Line with parchment paper; spray with additional baking spray. Set aside. Sprinkle 2 clean kitchen towels with 1/4 cup each confectioners' sugar; set aside.", "Beat cake mix, eggs and water in large bowl with electric mixer on low speed 30 seconds or until well blended. Beat on medium speed 2 minutes. Pour evenly into prepared pans.", "Bake 12 to 15 minutes or until wooden pick inserted in centers comes out clean. Run knife or small spatula around rims of pans to loosen cakes. Immediately invert each cake onto a prepared towel; remove pan. Carefully peel off paper. Starting at one of the short sides, roll up each cake and towel to form 2 separate rolls. Cool completely on wire racks.", "Meanwhile, combine cranberries and granulated sugar in medium saucepan; cook over medium heat 10 minutes or until juice of cranberries is released and sugar is dissolved, stirring occasionally. Stir in pecans. Cool completely.", "Unroll cakes. Spread 1/2 cup marmalade evenly over each cake to within 1 inch of edges; top evenly with cranberry mixture. Re-roll cakes, using towels as guide. Trim ends of each cake. Cut each cake into 10 slices. Top each slice with a serving of Reddi-wip. Serve immediately."]},
{"ingredients": ["2 cups boiling water", "1 (6 ounce) package lime-flavored gelatin mix (such as Jell-O®)", "2 (.25 ounce) envelopes unflavored gelatin", "1 lime, juiced", "1 teaspoon lemon juice", "2 cups ice water with ice cubes", "1 firm pear, peeled", "2 sprigs fresh dill", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Marvel's Shark Bites Recipe - Allrecipes.com"], "instructions": ["Pour boiling water over lime-flavored gelatin and unflavored gelatin in a bowl.", "Stir lime juice and lemon juice into gelatin mixture until gelatin has dissolved, 1 to 2 minutes.", "Pour ice water into gelatin mixture and stir until ice is melted, 2 to 3 minutes.", "Pour gelatin mixture into a clear glass bowl. Stretch a piece of plastic wrap over the bowl, and refrigerate gelatin until still soft but beginning to set, 10 to 15 minutes.", "While gelatin is setting up, carve pear into a shark shape with a small, sharp knife. Cut wide end of pear into the head, carve back and side fins, and carve the narrow end into the tail.", "Remove plastic wrap from bowl, and gently insert pieces of dill \"seaweed\" into the gelatin. Immerse the pear shark into the gelatin. Cover the bowl back up with the plastic wrap.", "Use a long skewer or cake tester to puncture the plastic wrap and skewer the shark vertically through the middle to help it stay in position as gelatin sets up. Refrigerate until firm, 2 to 4 hours.", "Carefully remove skewer from shark and remove plastic wrap before serving."]},
{"ingredients": ["1 quart whiskey", "1/2 lemon", "4 1/2 cups white sugar", "1 quart milk", "6 (1 ounce) squares unsweetened chocolate", "2 vanilla beans", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Portuguese Licoro Recipe - Allrecipes.com"], "instructions": ["In a gallon container combine whiskey, lemon, sugar, milk, chocolate squares and vanilla beans. Keep at room temperature for 10 days, stirring once a day.", "After 10 days, remove the lemon half, chocolate and vanilla beans. Insert a coffee filter into a large funnel. pour the liquid through the filter into a gallon jug. Change filter as needed. A clear yellow solution should result. This liqueur can be stored in a sealed bottle at room temperature."]},
{"ingredients": ["3 cups all-purpose flour", "1 tablespoon baking powder", "1 teaspoon cinnamon", "3/4 cup white sugar", "1 egg", "1 cup apple cider", "1/3 cup vegetable oil", "1 apple, peeled, cored and chopped", "1 (28 ounce) jar prepared mincemeat", "3/4 cup confectioners' sugar", "1/4 teaspoon cinnamon", "1 tablespoon apple cider, or as needed", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Holiday Mincemeat Muffins Recipe - Allrecipes.com"], "instructions": ["Preheat an oven to 400 degrees F (200 degrees C). Line 18 muffin cups with paper liners, and set aside.", "In a large bowl, stir together the flour, baking powder, 1 teaspoon cinnamon, and white sugar, mixing until thoroughly blended.", "In another bowl, whisk together the egg, 1 cup of apple cider, and vegetable oil. Stir in the apple and mincemeat. Pour the mincemeat mixture into the flour mixture, and stir until just combined.", "Fill the lined muffin cups 3/4 full, and bake in the preheated oven until the muffins are risen and browned, and a toothpick inserted into the middle of a muffin comes out clean, about 20 minutes. Let cool for about 10 minutes.", "Make a glaze by stirring together the confectioners' sugar, 1/4 teaspoon of cinnamon, and about 1 tablespoon of apple cider, or a little more as needed to make the glaze workable. Spread the glaze on the warm muffins."]},
{"ingredients": ["1 (12 ounce) can lite luncheon meat (such as Spam®)", "cooking spray", "1/2 (1.25 ounce) package taco seasoning mix, or more to taste", "2 tablespoons water, or more as needed", "8 (6 inch) flour tortillas", "8 ounces shredded lettuce", "8 ounces Cheddar cheese, shredded", "2 (2.25 ounce) cans sliced olives, drained", "1 small tomato, diced", "1 small onion, diced", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Spam® Tacos Recipe - Allrecipes.com"], "instructions": ["Shred luncheon meat onto a large plate using a cheese grater.", "Spray a large skillet with cooking spray and heat over medium-high heat. Add shredded luncheon meat; cook and stir until it begins to brown, about 5 minutes. Stir in taco seasoning and water. Cook and stir until luncheon meat is evenly seasoned and lightly browned, 5 to 7 minutes. Reduce heat to low to keep warm.", "Spray another skillet with cooking spray and heat over medium-high heat. Place 1 tortilla in the skillet and cook until heated through, about 30 seconds per side. Repeat with remaining tortillas.", "Top warm tortillas with luncheon meat, lettuce, Cheddar cheese, olives, tomato, and onion."]},
{"ingredients": ["3 cloves garlic, crushed", "1 onion, coarsely chopped", "1 cucumber, sliced", "1 green bell pepper, seeded and chopped", "5 tomatoes, peeled and quartered", "1/4 cup olive oil", "1/4 cup distilled white vinegar", "1 bunch fresh parsley, chopped", "salt and pepper to taste", "1 teaspoon paprika", "1 (12 fluid ounce) can tomato juice", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Gazpacho a la Mrs. Landesman Recipe - Allrecipes.com"], "instructions": ["In the container of a food processor or blender, combine the garlic, onion, cucumber, bell pepper, tomatoes, olive oil, vinegar, parsley, salt and pepper. Cover and blend to your desired texture. Stir in the tomato sauce and paprika and transfer to a bowl or container. Refrigerate for at least 1 hour to blend the flavors."]},
{"ingredients": ["1/4 cup ice cream, divided", "1 fluid ounce root beer, or as needed", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Easy Popsicle® Floats Recipe - Allrecipes.com"], "instructions": ["Spoon 2 tablespoons ice cream into the bottom of an ice pop mold. Pour in root beer to slightly over half-full; top with 1 tablespoon ice cream. Freeze until firm, 8 hours to overnight.", "Remove ice pop mold from the freezer; add remaining 1 tablespoon of ice cream to the top of the mold. Freeze until firm, 4 to 6 hours."]},
{"ingredients": ["1 1/4 cups cherries, pitted and halved", "1/2 cup chilled coconut milk", "1/4 cup strawberries, stemmed and hulled", "1/2 banana", "1 lime, juiced", "Add all ingredients to list", "Add all ingredients to list"], "recipe": ["Cherry Berry Coconut Limeade Smoothie Recipe - Allrecipes.com"], "instructions": ["Place cherries, coconut milk, strawberries, banana, and lime juice in a blender. Cover and blend until smooth."]}
]
